gbm-ii/STM32_Inc/stm32c0yy.h
/*
	STM32G0 series enhanced defs - register/bit defs not present in stm32g0xx.h file
	to be included instead of stm32g0xx.h
	gbm 2020..2024
*/

#ifndef __STM32C0YY_H
#define __STM32C0YY_H

#include "stm32c0xx.h"
#include "stm32yyyy.h"

// ADC ===================================================================
//enum adc_smpr_ {};
#define ADC_SMPR_1_5	0u
#define ADC_SMPR_3_5	1u
#define ADC_SMPR_7_5	2u
#define ADC_SMPR_12_5	3u
#define ADC_SMPR_19_5	4u
#define ADC_SMPR_39_5	5u
#define ADC_SMPR_79_5	6u
#define ADC_SMPR_160_5	7u	// 17 us @ 14 MHz - for TS

// internally-connected ADC channels
#define ADCH_TSEN	9u
#define ADCH_VREFINT	10u
#define ADCH_VDDA	15u
#define ADCH_VSSA	16u
// System ROM ============================================================
#define SYSROM_BASE	0x1fff0000
#define BOOT_ADDR	0x1fff0000	// System ROM bootloader
// Calibration values stored in ROM
#define VREFINT_CAL_mV	3000u	// calibration voltage
#define VREFINT_CAL	(*(const uint16_t *)0x1fff756a)

#define TS_CAL1_T 30
#define TS_CAL1	(*(const uint16_t *)0x1fff7568)	// at 30 C
// DMAMUX ================================================================
enum dmamux_in_ {
	DMAMUX_IN_REQ_GEN0 = 1, DMAMUX_IN_REQ_GEN1, DMAMUX_IN_REQ_GEN2, DMAMUX_IN_REQ_GEN3,
	DMAMUX_IN_ADC,

	DMAMUX_IN_I2C1_RX = 10, DMAMUX_IN_I2C1_TX, DMAMUX_IN_I2C_RX, DMAMUX_IN_I2C2_TX,
	DMAMUX_IN_SPI1_RX = 16, DMAMUX_IN_SPI1_TX,
	DMAMUX_IN_SPI2_RX = 18, DMAMUX_IN_SPI2_TX,
	DMAMUX_IN_TIM1_CH1 = 20, DMAMUX_IN_TIM1_CH2, DMAMUX_IN_TIM1_CH3, DMAMUX_IN_TIM1_CH4,
	DMAMUX_IN_TIM1_TRIG_COM, DMAMUX_IN_TIM1_UP,
	DMAMUX_IN_TIM2_CH1, DMAMUX_IN_TIM2_CH2, DMAMUX_IN_TIM2_CH3, DMAMUX_IN_TIM2_CH4,
	DMAMUX_IN_TIM2_TRIG, DMAMUX_IN_TIM2_UP,
	DMAMUX_IN_TIM3_CH1, DMAMUX_IN_TIM3_CH2, DMAMUX_IN_TIM3_CH3, DMAMUX_IN_TIM3_CH4,
	DMAMUX_IN_TIM3_TRIG, DMAMUX_IN_TIM3_UP,
	DMAMUX_IN_TIM16_CH1 = 44, DMAMUX_IN_TIM16_COM, DMAMUX_IN_TIM16_UP,
	DMAMUX_IN_TIM17_CH1, DMAMUX_IN_TIM17_COM, DMAMUX_IN_TIM17_UP,
	DMAMUX_IN_USART1_RX = 50, DMAMUX_IN_USART1_TX, DMAMUX_IN_USART2_RX, DMAMUX_IN_USART2_TX,
};
// Flash =================================================================
#ifndef FLASH_PAGE_SIZE
#define FLASH_PAGE_SIZE	2048u
#endif

#define FLASH_SR_BSY	FLASH_SR_BSY1
#define FLASH_CR_PNBV(v)	((v) << FLASH_CR_PNB_Pos & FLASH_CR_PNB_Msk)
#define FLASH_UID	((const uint32_t *)UID_BASE)
// GPIO ==================================================================
#define GPIO_OSPEEDR_VLO	0	// 2 MHz
#define GPIO_OSPEEDR_LO	1u		// 10 MHz
#define GPIO_OSPEEDR_HI	2u		// 30 MHz
#define GPIO_OSPEEDR_VHI	3u	// 60 MHz

enum afn_ {AFN_SYS, AFN_USART1_2, AFN_TIM1, AFN_TIM2,
	AFN_USARTx, AFN_TIMx, AFN_I2C, AFN_EVTOUT,
};
// RCC ===================================================================
#define RCC_AHBENR_RSTVAL	(RCC_AHBENR_FLASHEN)
// RCC GPIO enable -------------------------------------------------------
#define IOENR	IOPENR	// IO port enable register alias
#define RCC_IOENR_GPIOAEN	RCC_IOPENR_GPIOAEN
//#define RCC_IOENR_GPIOENBIT(idx) ( (RCC_IOPENR_GPIOAEN) << (idx) )

// RCC->CFGR bitfields ---------------------------------------------------
#define RCC_CFGR_SW_HSISYS	0u
#define RCC_CFGR_SW_HSE		1u
#define RCC_CFGR_SW_HSIUSB	2u
#define RCC_CFGR_SW_LSI		3u
#define RCC_CFGR_SW_LSE		4u

#include "stm32util.h"

#endif
